# -- DevOps tools
# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "helm"
brew "helmfile"
tap "fluxcd/tap"
brew "fluxcd/tap/flux@2.3"

# UI
brew "k9s"

# Cloud
brew "azure-cli"
brew "awscli"
cask "session-manager-plugin", greedy: true
brew "opentofu"

# Scanner
brew "trivy"

# -- General
brew "direnv"
brew "stow"
brew "jq"
brew "yq"
brew "coreutils"
brew "sops"
brew "bind"
brew "tcptraceroute"
brew "curl"
brew "wget"
brew "git"
brew "age"
brew "go-task"
brew "btop"
brew "nmap"
brew "tcpdump"
brew "gnupg"
brew "pinentry"
brew "pinentry-mac"
tap "jorgelbg/tap"
brew "pinentry-touchid"
brew "telnet"
tap "cormacrelf/tap"
brew "dark-notify"

# -- Languages
brew "node"
brew "cosign"
brew "openjdk"
brew "Azure/kubelogin/kubelogin"
brew "terragrunt"
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
brew "rust"
brew "go"
cask "openkey", greedy: true

# -- Other Apps
cask "karabiner-elements", greedy: true
cask "1password-cli", greedy: true
cask "pgadmin4", greedy: true
cask "nikitabobko/tap/aerospace", greedy: true
cask "logi-options+", greedy: true
# tap "FelixKratz/formulae"
# brew "sketchybar"

# -- Editor
brew "tmux"
brew "neovim"
cask "obsidian", greedy: true

# -- Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# -- Git
# depend on Python
brew "commitizen"
brew "pre-commit"

# -- Neovim tools
brew "fzf"
brew "ripgrep"
brew "lazygit"
brew "lazydocker"
brew "kubeconform"

# -- Fonts
cask "font-hack-nerd-font", greedy: true
cask "font-jetbrains-mono-nerd-font", greedy: true
cask "font-sf-pro", greedy: true
cask "sf-symbols", greedy: true
cask "font-meslo-lg-nerd-font", greedy: true
