# Kubernetes
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "helm"
brew "helmfile"
tap "fluxcd/tap"
brew "fluxcd/tap/flux"
brew "cilium-cli"
brew "istioctl"

# UI
brew "k9s"

# Cloud
brew "azure-cli"
brew "awscli"
brew "terragrunt"
# brew "opentofu"
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

# -- General
brew "zsh"
brew "direnv"
brew "stow"
brew "jq"
brew "yq"
brew "coreutils"
brew "sops"
brew "bind"
brew "tcptraceroute"
brew "curl"
brew "wget"
brew "git"
brew "age"
brew "btop"
brew "nmap"
brew "tcpdump"
brew "telnet"
brew "cosign"

# -- Languages
brew "node"
brew "openjdk"
brew "rust"
brew "rust-analyzer"
brew "go"
brew "terraform-ls"

# -- Other Apps
cask "nikitabobko/tap/aerospace", greedy: true
cask "bitwarden", greedy: true
cask "ghostty", greedy: true
cask "homerow", greedy: true
cask "openkey", greedy: true
cask "pgadmin4", greedy: true
cask "zed", greedy: true

# -- Editor
cask "obsidian", greedy: true
brew "tmux"
brew "neovim"

# -- Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# -- Git
brew "commitizen"
brew "pre-commit"

# -- Neovim tools
brew "fzf"
brew "ripgrep"
brew "lazygit"
brew "lazydocker"
brew "kubeconform"
brew "tree-sitter-cli"

# -- Fonts
cask "font-meslo-lg-nerd-font", greedy: true
