ghostty
kubeconform
aws-cli-v2
terragrunt
terraform
sops
lazydocker
azure-cli
kubectl
kubectx
kustomize
helm
helmfile
cilium-cli
istio
k9s
direnv
stow
jq
yq
bind
curl
wget
git
age
btop
nmap
tcpdump
cosign
jdk-openjdk
nodejs
nvm
pnpm
corepack
npm
unzip
rust
rust-analyzer
go
tmux
neovim
vlc
obsidian
zsh
zsh-autosuggestions
zsh-completions
zsh-history-substring-search
zsh-syntax-highlighting
pre-commit
fzf
ripgrep
lazygit
tree-sitter
tree-sitter-cli
bitwarden
fcitx5
fcitx5-unikey
fcitx5-configtool
fcitx5-gtk
ttf-meslo-nerd
